#+TITLE: Large Test Document - Performance Benchmark
#+AUTHOR: Test User
#+EMAIL: test@example.com
#+DATE: <2024-01-15 Mon>
#+STARTUP: overview
#+OPTIONS: toc:3 num:t H:5
#+PROPERTY: header-args :exports both :eval never-export
#+PROPERTY: header-args:python :session *python*
#+MACRO: version 2.5.0
#+MACRO: author Test Author
#+MACRO: date 2024-01-15

** TODO [#B] Medium Priority Task 1                               :standard:
SCHEDULED: <2024-01-28 Sun>
:LOGBOOK:
CLOCK: [2024-01-15 Mon 10:00]--[2024-01-15 Mon 11:30] =>  1:30
CLOCK: [2024-01-14 Sun 14:00]--[2024-01-14 Sun 16:00] =>  2:00
:END:

Work logged on this task.

** DONE [#C] Completed Task 2                                        :done:
CLOSED: [2024-01-12 Fri 17:00]
:LOGBOOK:
CLOCK: [2024-01-12 Fri 14:00]--[2024-01-12 Fri 17:00] =>  3:00
CLOCK: [2024-01-11 Thu 09:00]--[2024-01-11 Thu 12:00] =>  3:00
:END:

Another completed task with time tracking.

** Calculations Table

| Item       | Quantity | Unit Price | Total     |
|------------+----------+------------+-----------|
| Widget A   |       10 |       5.50 |     55.00 |
| Widget B   |       25 |       3.25 |     81.25 |
| Widget C   |       15 |       7.00 |    105.00 |
| Widget D   |        8 |      12.50 |    100.00 |
| Widget E   |       30 |       2.00 |     60.00 |
|------------+----------+------------+-----------|
| Subtotal   |          |            |    401.25 |
| Tax (8%)   |          |            |     32.10 |
| Total      |          |            |    433.35 |
#+TBLFM: $4=$2*$3::@7$4=vsum(@2$4..@6$4)::@8$4=@7$4*0.08::@9$4=@7$4+@8$4

** Complex Table with References

| Month     | Revenue  | Expenses | Profit   | Growth |
|-----------+----------+----------+----------+--------|
| January   |  120000  |   85000  |    35000 |     0% |
| February  |  135000  |   90000  |    45000 |   +29% |
| March     |  142000  |   88000  |    54000 |   +20% |
| April     |  138000  |   92000  |    46000 |   -15% |
| May       |  155000  |   95000  |    60000 |   +30% |
| June      |  162000  |   98000  |    64000 |    +7% |
|-----------+----------+----------+----------+--------|
| H1 Total  |  852000  |  548000  |   304000 |        |
#+TBLFM: $4=$2-$3::@8$2=vsum(@2$2..@7$2)::@8$3=vsum(@2$3..@7$3)::@8$4=vsum(@2$4..@7$4)

** Logbook Drawer

:LOGBOOK:
CLOCK: [2024-01-15 Mon 09:00]--[2024-01-15 Mon 12:00] =>  3:00
CLOCK: [2024-01-14 Sun 14:00]--[2024-01-14 Sun 17:30] =>  3:30
CLOCK: [2024-01-13 Sat 10:00]--[2024-01-13 Sat 11:45] =>  1:45
- State "DONE"       from "TODO"       [2024-01-15 Mon 12:00]
- State "TODO"       from "NEXT"       [2024-01-14 Sun 14:00]
- Refiled on [2024-01-13 Sat 10:00]
:END:

Content with logbook.

